Дипломный_проект/src/Documents/ВКМ_НачислениеОтпускных/ВКМ_НачислениеОтпускных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеОтпускных</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоходЗа12Месяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Дипломный_проект/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_Календарь</schedule>
  <scheduleValue>InformationRegister.ВКМ_Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПочасовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Дипломный_проект/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_Календарь</schedule>
  <scheduleValue>InformationRegister.ВКМ_Календарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Дипломный_проект/src/Documents/ВКМ_НачислениеОтпускных/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.Сотрудник.Доступность = Ложь;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
				
		Объект.ДнейОтпуска = (Объект.ДатаОкончания - Объект.ДатаНачала + 86400) / 86400;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.Сотрудник.Доступность = Истина; 
		
		Объект.ДнейОтпуска = (Объект.ДатаОкончания - Объект.ДатаНачала + 86400) / 86400;
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			
			РассчитатьОтпускные();	
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.Сотрудник.Доступность = Истина; 
		
		Объект.ДнейОтпуска = (Объект.ДатаОкончания - Объект.ДатаНачала + 86400) / 86400;
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			
			РассчитатьОтпускные();	
			
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент) 
	
	РассчитатьОтпускные();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьОтпускные()   
	
	КонецРасчетногоПериода = Объект.ДатаНачала - 86400;
	НачалоРасчетногоПериода  = ДобавитьМесяц(КонецРасчетногоПериода, -12);  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0)) КАК ОтработаноДней,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	               |	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат, 0)) КАК Результат
	               |ПОМЕСТИТЬ вт_ОсновныеНачисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = &Сотрудник
	               |	И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодРегистрации МЕЖДУ &Начало И &Конец
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(вт_ОсновныеНачисления.ОтработаноДней, 0)) КАК ОтработаноДней,
	               |	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)) КАК СуммаДополнительная,
	               |	СУММА(ЕСТЬNULL(вт_ОсновныеНачисления.Результат, 0)) КАК СуммаОсновная
	               |ИЗ
	               |	вт_ОсновныеНачисления КАК вт_ОсновныеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |		ПО вт_ОсновныеНачисления.Сотрудник = ВКМ_ДополнительныеНачисления.Сотрудник
	               |			И (ВКМ_ДополнительныеНачисления.ПериодРегистрации МЕЖДУ &Начало И &Конец)";
	
	Запрос.УстановитьПараметр("Начало", НачалоРасчетногоПериода);
	Запрос.УстановитьПараметр("Конец", КонецРасчетногоПериода);  
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	РезультатЗапроса =  Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если Выборка.ОтработаноДней = 0 Тогда
		
			Объект.ОтработаноДней = 0;	
			Объект.ДоходЗа12Месяцев = 0;
			Объект.Размер = 0;
			
		Иначе 
		
			Объект.ОтработаноДней = Выборка.ОтработаноДней;	
			Объект.ДоходЗа12Месяцев = Выборка.СуммаОсновная + Выборка.СуммаДополнительная;
			Объект.Размер = (Объект.ДоходЗа12Месяцев / Объект.ОтработаноДней) * Объект.ДнейОтпуска;
	
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти
